Repository: frispete/colander
Catalog: colander/locale/*/LC_MESSAGES/colander.po
Languages: de

source: Invalid value
de: Ungültiger Wert

source: String does not match expected pattern
de: Die Zeichenkette entspricht nicht dem erwarteten Muster

source: Invalid email address
de: Ungültige E-Mail-Adresse

source: ${val} is less than minimum value ${min}
de: ${val} ist kleiner als der erlaubte Mindestwert (${min})

source: ${val} is greater than maximum value ${max}
de: ${val} ist größer als der erlaubte Höchstwert (${max})

source: Shorter than minimum length ${min}
de: Kürzer als erlaubt, die Mindestlänge beträgt ${min}

source: Longer than maximum length ${max}
de: Länger als erlaubt, die Maximallänge beträgt ${max}

source: "${val}" is not one of ${choices}
de: "${val}" ist nicht in der Auswahl ${choices}

source: "${val}" must not be one of ${choices}
de: "${val}" darf nichts von ${choices} sein

source: One or more of the choices you made was not acceptable
de: Mindestens eine Auswahl war nicht akzeptabel

source: "${val}" is not a valid credit card number
de: "${val}" ist keine gültige Kreditkartennummer

source: Must be a URL
de: Muss eine URL sein

source: Invalid UUID string
de: Ungültige UUID Zeichenkette

source: "${val}" is not a mapping type: ${err}
de: "${val}" ist kein Mapping: ${err}

source: Unrecognized keys in mapping: "${val}"
de: Unbekannte Schlüssel im Mapping: ${val}

source: "${val}" is not iterable
de: "${val}" ist nicht iterierbar

source: "${val}" has an incorrect number of elements (expected ${exp}, was ${was})
de: Ungültige Anzahl von Elementen (${was}, erwartet: ${exp})

source: ${cstruct} is not iterable
de: ${cstruct} ist nicht iterierbar

source: ${val} cannot be serialized: ${err}
de: ${val} kann nicht serialisiert werden: ${err}

source: ${val} is not a string: ${err}
de: ${val} ist keine Zeichenkette: ${err}

source: "${val}" is not a number
de: "${val}" ist keine Zahl

source: ${val} is not a string
de: ${val} ist keine Zeichenkette

source: "${val}" is neither in (${false_choices}) nor in (${true_choices})
de: "${val}" ist weder in (${false_choices}) noch in (${true_choices}) enthalten

source: relative name "${val}" irresolveable without package
de: relativer Name "${val}" ist ohne Paket nicht auflösbar

source: "${val}" has no __name__
de: "${val}" hat kein __name__ Attribut

source: "${val}" is not a string
de: "${val}" ist keine Zeichenkette

source: The dotted name "${name}" cannot be imported
de: Der Dotted-Name "${name}" kann nicht importiert werden

source: Invalid date
de: Ungültiges Datum

source: "${val}" is not a datetime object
de: "${val}" ist kein Datetime-Object

source: "${val}" is not a date object
de: "${val}" ist kein Date-Object

source: Invalid time
de: Ungültige Uhrzeit

source: "${val}" is not a time object
de: "${val}" ist kein Time-Objekt

source: fail ${val}
de: fehlgeschlagen ${val}
